public/terminal.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Terminal Basics</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Gerard Bentley">
<link rel="icon" type="image/x-icon" href="/favicon.ico"/>
</head>
<body>
<header id="top" class="status">
<h1 class="title">FAIM Resources
</h1>
<nav>
  <a href="/">Sitemap</a>
  <a href="/introduction.html">Intro</a>
  <a href="/research_papers.html">Papers</a>
</nav>
</header>
<main id="content">
<header>
<h1 class="title">Terminal Basics</h1>
</header><p>
The Terminal, also called <a href="https://askubuntu.com/questions/506510/what-is-the-difference-between-terminal-console-shell-and-command-line">shell, console, command line</a> (with a fair bit of nuance)
lets you access programs and files and execute commands on those programs and files without opening any apps or windows, it all stays in the terminal.
</p>

<p>
*Basic Navigation
</p>

<p>
When you open Terminal.app (on mac you can use command-spacebar then search `Terminal`) all you get is a blank command line prompt, probably ending with `$`
</p>

<p>
The terminal works like a filesystem/Finder window in that you need to navigate &rsquo;up&rsquo; and &rsquo;down&rsquo; folders to find different files.
When you open a new Terminal it is most likely located at your account&rsquo;s Home folder (also referred to as ~).
</p>

<p>
**NOTE: On Mac the ~ can be replaced with <i>Users/YOUR-USERNAME</i> for an absolute path (<a href="https://www.linuxnix.com/abslute-path-vs-relative-path-in-linuxunix/">absolute vs relative</a> explanation)
For reference, your Desktop folder is located at ~/Desktop, your Documents at ~/Documents
</p>

<p>
Now for the 3 Basic commands that will help you navigate around:
</p>

<p>
**pwd
</p>

<p>
`Print Working Directory`: Tells you where in the filesystem the command line is currently pointed. On a fresh Terminal window it should show <i>Users/YOUR-USERNAME</i>
</p>

<p>
**ls
</p>

<p>
`List`: Lists out all the files and directories in the current directory you&rsquo;re pointed at. Also helps you know where in the filesystem you are
</p>

<p>
**cd
</p>

<p>
`Change Directory`: Actually moves where the command line is pointed to a different directory / folder.
</p>

<p>
The common uses of `cd` and `ls`:
</p>

<p>
**Go to your project folder
</p>

<p>
On my personal computer I try to keep all my coding projects under a folder called `research` (in their own individual folders) which is in my Home folder (~/research or /Users/Gerard/research)
</p>

<p>
So to get to my project I open terminal and enter
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> research/my-project-folder
</pre>
</div>
<p>
***NOTE: This works because the Terminal is already pointed at my ~/ directory and `research` is in that directory. You can use `ls` to see if `research` is present
</p>

<p>
If you don&rsquo;t remember the project-folder name you can do the following
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> research
ls
</pre>
</div>
<p>
This will show you all the files and folders in `research`, then you can simply
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> project-folder-i-remember-now
</pre>
</div>

<p>
**Go back one or more directories
As ~/ is equivalent to <i>Users/YOUR-USERNAME</i> on mac, ./ is equivalent to `pwd`/
</p>

<p>
By this I mean that `.` represents the current working directory, where the terminal command line is pointed.
</p>

<p>
So the same command from before works the same like this (from a fresh Terminal located at ~/)
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> ./research/my-project-folder
</pre>
</div>

<p>
After executing that command, `pwd` will tell you the Terminal is at /Users/Gerard/research/my-project-folder, which we want because we just `cd`d into that directory
</p>

<p>
If we wanted to switch projects (to a different folder in `research`), we need to go &rsquo;up&rsquo; a folder. To do this we use `..` to represent the folder &rsquo;above&rsquo; the current folder
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> ..
</pre>
</div>
<p>
This brings us back to `research`, so `pwd` will say <i>Users/Gerard/research</i>
</p>

<p>
Now we can cd into a different folder
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> my-other-project-folder
</pre>
</div>

<p>
If we wanted to switch to a different project directly in one command we can use
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> ../third-folder
</pre>
</div>
<p>
I think of this as `going to third-folder, which is in the folder above the current one`
</p>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2020-01-22</p>
<p class="author">Author: Gerard Bentley</p>
<p class="date">Created: 2020-01-24</p>
</footer>
</body>
</html>
